toniebox-reverse-engineering/teddycloud/embedded/cyclone/cyclone_crypto/hardware/efm32gg11/efm32gg11_crypto_cipher.c
void gcmMul(GcmContext *context, uint8_t *x)
{
   const uint32_t pad[4] = {0, 0, 0, 0};

   //Acquire exclusive access to the CRYPTO module
   osAcquireMutex(&efm32gg11CryptoMutex);

   //Set wide arithmetic configuration
   CRYPTO0->WAC = 0;
   CRYPTO0->CTRL = 0;

   //Set CRYPTO module parameters
   CRYPTO_ModulusSet(CRYPTO0, cryptoModulusGcmBin128);
   CRYPTO_MulOperandWidthSet(CRYPTO0, cryptoMulOperand128Bits);
   CRYPTO_ResultWidthSet(CRYPTO0, cryptoResult128Bits);

   //Copy the hash subkey H
   CRYPTO_DataWrite(&CRYPTO0->DDATA1, context->m[0]);
   CRYPTO_DataWrite(&CRYPTO0->DDATA1, pad);

   //Copy the input value
   CRYPTO_DataWrite(&CRYPTO0->DDATA2, (const uint32_t *) x);
   CRYPTO_DataWrite(&CRYPTO0->DDATA2, pad);

   //Perform GF(2^128) multiplication
   CRYPTO_EXECUTE_11(CRYPTO0,
      CRYPTO_CMD_INSTR_SELDDATA1DDATA0,
      CRYPTO_CMD_INSTR_BBSWAP128,
      CRYPTO_CMD_INSTR_DDATA0TODDATA1,
      CRYPTO_CMD_INSTR_SELDDATA2DDATA0,
      CRYPTO_CMD_INSTR_BBSWAP128,
      CRYPTO_CMD_INSTR_DDATA0TODDATA2,
      CRYPTO_CMD_INSTR_SELDDATA0DDATA2,
      CRYPTO_CMD_INSTR_MMUL,
      CRYPTO_CMD_INSTR_DDATA0TODDATA1,
      CRYPTO_CMD_INSTR_SELDDATA1DDATA0,
      CRYPTO_CMD_INSTR_BBSWAP128);

   //Wait for the instruction sequence to complete
   CRYPTO_InstructionSequenceWait(CRYPTO0);

   //Copy the resulting value
   CRYPTO_DataRead(&CRYPTO0->DDATA0, (uint32_t *) x);

   //Release exclusive access to the CRYPTO module
   osReleaseMutex(&efm32gg11CryptoMutex);
}

#endif
#endif
